#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-UZoiQX2AU7CUrwzv

Waiting for the plan to start...

Terraform v1.2.1
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_cluster.openarabic: Reading...
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
data.digitalocean_kubernetes_cluster.openarabic: Read complete after 2s [id=a4393850-71dd-4c50-a1c2-08af9013e1b1]
helm_release.prometheus-stack: Refreshing state... [id=prometheus-stack]
helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
helm_release.istio-base: Refreshing state... [id=istio-base]
helm_release.flagger: Refreshing state... [id=flagger]
helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
kubernetes_namespace.gateway: Refreshing state... [id=gateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.istio-base will be updated in-place
  ~ resource "helm_release" "istio-base" {
        id                         = "istio-base"
        name                       = "istio-base"
      ~ version                    = "1.13.4" -> "1.14.0"
        # (25 unchanged attributes hidden)
    }

  # helm_release.istio-ingress will be updated in-place
  ~ resource "helm_release" "istio-ingress" {
        id                         = "istio-ingress"
        name                       = "istio-ingress"
      ~ version                    = "1.13.4" -> "1.14.0"
        # (25 unchanged attributes hidden)
    }

  # helm_release.istio-istiod will be updated in-place
  ~ resource "helm_release" "istio-istiod" {
        id                         = "istio-istiod"
        name                       = "istio-istiod"
      ~ version                    = "1.13.4" -> "1.14.0"
        # (25 unchanged attributes hidden)
    }

  # helm_release.prometheus-stack will be updated in-place
  ~ resource "helm_release" "prometheus-stack" {
        id                         = "prometheus-stack"
        name                       = "prometheus-stack"
      ~ version                    = "35.4.2" -> "35.5.1"
        # (25 unchanged attributes hidden)
    }

  # kubernetes_namespace.openarabic will be created
  + resource "kubernetes_namespace" "openarabic" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "istio-injection" = "enabled"
            }
          + name             = "openarabic"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 4 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*